In [21]:
numpynumpy.

67

In [30]:
a = np.array([1,2,3,4,5])

In [32]:
a.max()

5

In [38]:
a=np.array([1,2,3,4,5,6])

In [53]:
a[1:6]

array([2, 3, 4, 5, 6])

In [69]:
a = np.array([1,2,3,5,6])

In [72]:
a[1:3]=111

In [73]:
a

array([  1, 111, 111,   5,   6])

In [74]:
a[3]=1111

In [75]:
a

array([   1,  111,  111, 1111,    6])

In [94]:
c = a.copy()

In [95]:
c

array([   1,  111,  111, 1111,    6])

In [96]:
c[0] = 0

In [97]:
c

array([   0,  111,  111, 1111,    6])

In [98]:
a

array([   1,  111,  111, 1111,    6])

In [10]:
#importing files
import pandas as pd
df= pd.read_csv('C:\\Users\\anil\\Desktop\\STUDY AREA\\PYTHON FOR DATA SCIENCE
\\DemographicData.csv',sep=',')

SyntaxError: EOL while scanning string literal (<ipython-input-10-48773097e1c2>, line 3)

In [3]:
import os

In [5]:
print(os.getcwd())

C:\Users\anil\Desktop\STUDY AREA\PYTHON FOR DATA SCIENCE

In [15]:
os.chdir('C:\\Users\\anil\\Desktop\\STUDY AREA\\PYTHON FOR DATA SCIENCE')

In [18]:
df = pd.read_csv("DemographicData.csv")
df

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [27]:
import pandas as pd
df = pd.read_csv("C:\\Users\\anil\\Desktop\\STUDY AREA\\PYTHON FOR DATA SCIENCE\\DemographicData.csv")

In [28]:
df

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [30]:
import pandas as pd
df6 = pd.read_csv("C:\\Users\\anil\\Desktop\\STUDY AREA\\PYTHON FOR DATA SCIENCE\\movieratings.csv")

In [31]:
df6

,Film,Genre,Rotten Tomatoes Ratings %,Audience Ratings %,Budget (million $),Year of release
0,(500) Days of Summer,Comedy,87,81,8,2009
1,"10,000 B.C.",Adventure,9,44,105,2008
2,12 Rounds,Action,30,52,20,2009
3,127 Hours,Adventure,93,84,18,2010
4,17 Again,Comedy,55,70,20,2009
...,...,...,...,...,...,...
554,Your Highness,Comedy,26,36,50,2011
555,Youth in Revolt,Comedy,68,52,18,2009
556,Zodiac,Thriller,89,73,65,2007
557,Zombieland,Action,90,87,24,2009
558,Zookeeper,Comedy,14,42,80,2011